<?php
    return array(
        'invest'=>array(
            '88'  =>  '交易成功',
            '01'  =>  '转账列表错误',
            '02' =>   '操作类型错误',
            '03' =>   '转账方式错误',
            '04' =>   '平台乾多多标识错误',
            '05'  =>  '签名验证失败',
            '06'  =>  '付款人乾多多标识错误',
            '07'  =>  '收款人乾多多标识错误',
            '08'  =>  '平台订单号错误',
            '09'  =>  '平台标号错误',
            '10'  =>  '金额错误',
            '11'  =>  '付款人不唯一',
            '13'  =>  '付款人未绑定乾多多',
            '14'  =>  '付款人乾多多绑定的网贷平台错误',
            '16'  =>  '收款人未绑定乾多多',
            '17'  =>  '收款人乾多多绑定的网贷平台错误',
            '18'  =>  '重复订单',
            '21'  =>  '乾多多账户可用余额不足',
            '22'  =>  '支付密码输入错误',
            '23'  =>  '短信验证码输入错误',
            '24'  =>  '安保问题输入错误',
            '25'  =>  '转账类型错误',
            '26'  =>  '账户正在被别的线程操作',
            '27'  =>  '标额错误',
            '28'  =>  '投标总金额超过标额',
            '29'  =>  '二次分配列表错误',
            '30'  =>  '二次分配金额超过转账金额',
            '31'  =>  '自动转账未授权',
            '32'  =>  '通过是否需要审核参数错误',
            '33'  =>  '随机时间戳错误',
            '34'  =>  '自定义备注错误',
            '35'  =>  '密码、验证码或安保问题错误次数过多，锁定中',
            '36'  =>  '收款人二次分配未授权'
        )
        
    );  
?>
